students = [
    "ธนวินท์", "ปภังกร", "พรพิพัฒน์", "ภูมิฉัตร", "ไวภพ", "ไอศูรย์", "วรท", "บึงพิพัฒน์", "พัทธนันท์",
    "รุจิภาส", "สรวิชญ์", "บุณยกร", "ชิษณุพงศ์", "สรยุทธ", "ฐตวรรณ", "จีรัชญ์", "ชยางกูร", "ไชยพศ",
    "ปองคุณ", "ศรัณยพงศ์", "รวิพล", "วิธวินท์", "ตรัยรัตน์", "ธาวิน", "วีรภัฏ", "จิรายุ", "เอกราช",
    "สิรวิชญ์", "ฐิติวัชร์", "เสฏพงศ์", "ภคินธ์", "ภณิตา", "กาญจนา", "พชรมน", "ณัฐวิภา", "ธิชานัน",
    "นันทิชา", "อิษฎาอร", "พิมพ์มาดา", "สุวภัทร"
]
my_name = "สิรวิชญ์"
for name in students:
    if name != my_name:
        print(name)