<!DOCTYPE html>
<html lang="th">
<head>
    <meta charset="UTF-8">
    <title>ข้อมูลประวัตินักเรียน</title>
</head>
<body>




    <h2>ข้อมูลประวัตินักเรียน</h2>




    <?php
    $name = "สิรวิชญ์ ว่องกีรติกุล";
    $level = "ม.6";
    $room = "8";
    $num = "28";
    
    $address = "50/129 ซอยประชาอุทิศ 33 แยก 4 แขวงบางมด เขตทุ่งครุ กรุงเทพ 10140";
    $edu = "จบ ป.6 และ ม.3 จากโรงเรียนสารสาสน์ประชาอุทิศพิทยาคาร ปัจจุบันกำลังศึกษาอยู่โรงเรียนบางปะกอกวิทยาคม";

    echo "ชื่อ-สกุล: " . $name . "<br>";
    echo "เรียนอยู่ระดับชั้น: " . $level . " ห้องเรียน: " . $room . "<br>";
    echo "เลขที่: " . $num . "<br>";
    echo "ที่อยู่: " . $address . "<br>";
    echo "ประวัติการศึกษา: " . $edu . "<br>";
?>

    
</body>
</html>
