<?php
$students = [
    "นายสิรวิชญ์ ว่องกีรติกุล",
    "นายธนวินท์ ปัถวี",
    "นายปภังกร ลาภาศุภวัฒน์",
    "นายพรพิพัฒน์ ตั้งวิโรจน์กุล",
    "นายภูมิฉัตร ปานทุ่ง",
    "นายไวภพ เพ็ญพันธ์นาค",
    "นายไอศูรย์ อนุศักดิ์ชัยกุล",
    "นายวรท วงศ์คงสวัสดิ์",
    "นายบึงพิพัฒน์ บึงไกร",
    "นายพัทธนันท์ ประยูร",
    "นายรุจิภาส แสงอ่อง",
    "นายสรวิชญ์ ศรีลาออน",
    "นายบุณยกร เฉลิมพรวิทิต",
    "นายชิษณุพงศ์ ถํ้าบุญรัฐเศรษฐ์",
    "นายสรยุทธ บุตรวงค์",
    "นายฐตวรรณ พงษ์พยัคฆ์",
    "นายจีรัชญ์ ขวัญแก้ว",
    "นายชยางกูร เชื้อเจริญ",
    "นายไชยพศ จัดเจนนาวี",
    "นายปองคุณ อนุกิตติรัตน์",
    "นายศรัณยพงศ์ เอกอัครพรพล",
    "นายรวิพล ฤกษ์สมบูรณ์ดี",
    "นายวิธวินท์ หอมอ่อน",
    "นายตรัยรัตน์ ประทีปคีรี",
    "นายธาวิน ลาภสมบัติศิริ",
    "นายวีรภัฏ หุณฑะสิริ",
    "นายจิรายุ ชัยปรีชา", 
    "นายเอกราช ลุนณี",
    "นายฐิติวัชร์ เลิศทักษิณานนท์",
    "นายเสฏพงศ์ สุวรรณวงศ์",
    "นายภคินธ์ ไชยเดช",
    "นางสาวภณิตา พึ่งใจ",
    "นางสาวกาญจนา คชศิลา",
    "นางสาวพชรมน พลค้อ",
    "นางสาวณัฐวิภา วงศ์ทองเครือ",
    "นางสาวธิชานัน พลจอหอ",
    "นางสาวนันทิชา มานํ้าเที่ยง",
    "นางสาวอิษฎาอร โชคมงคลเสถียร",
    "นางสาวพิมพ์มาดา เที่ยงสั้น",
    "นางสาวสุวภัทร ปิงเมือง"
];

$total_students = count($students); 

echo "<h2>=== รายงานรายชื่อนักเรียน ห้อง 6/8 ===</h2>";


echo "<h3>1. แสดงผลด้วยคำสั่ง foreach loop</h3>";
$order_foreach = 1; 
foreach ($students as $name) {
    echo "ลำดับที่ " . $order_foreach . " : " . $name . "<br>";
    $order_foreach++;
}

echo "<hr>"; 


echo "<h3>2. แสดงผลด้วยคำสั่ง for loop</h3>";
for ($i = 0; $i < $total_students; $i++) {
    $order_for = $i + 1;
    echo "ลำดับที่ " . $order_for . " : " . $students[$i] . "<br>";
}

echo "<hr>";


echo "<h3>3. แสดงผลด้วยคำสั่ง while loop</h3>";
$w = 0;
while ($w < $total_students) {
    $order_while = $w + 1;
    echo "ลำดับที่ " . $order_while . " : " . $students[$w] . "<br>";
    $w++;
}
?>